Revit 2027 API
AreaReinforcement.GetRebarInSystemIds Method
 Returns the ids of the RebarInSystem elements owned by the AreaReinforcement element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetRebarInSystemIds()
Public Function GetRebarInSystemIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetRebarInSystemIds()
member GetRebarInSystemIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
Remarks
 The RebarInSystem elements are only created if ReinforcementSettings.HostStructuralRebar is set to true. If that setting is false, this function returns an empty array.
See Also
Reference
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace